{
  "projects": [
    {
    "title": "EE Product Page",
    "description": "Combining business goals, such as increased user log ins, increased conversation, and UX improvments, this project simplifies a complex configuration process, increases upsell possibilities and provides a supportive journey to customers.",
    "tags": [
      "UI Design", "Prototyping", "Figma"
    ],
    "backgroundColour": "radial-gradient(79.83% 181.5% at 93.4% 2.72%, #7ABBB7 0%, #0F2D2B 100%)",
    "darkerColour": "#0F2D2B",
    "heroImage": "EE_4000x2000.png",
    "caseStudyContent": {
      "heading": "EE Product Page",
      "subHeading": "Combining business goals, such as increased user log ins, increased conversation, and UX improvments, this project simplifies a complex checkout process, increases upsell possibilities and provides a supportive journey to customers.",
      "projectLink": null,
      "team": [{
        "name": "Eddie Tierney",
        "role": ["Product Designer"]
      }, {
        "name": "Jordan Joseph",
        "role": ["Content Designer"]
      }, {
        "name": "Stefano Chiesa",
        "role": ["Product Designer"]
      }],
      "tools": [{
        "name": "Figma",
        "icon": "icons_figma--dark"
      },{
        "name": "Prototyping",
        "icon": "icons_prototype--dark"
      }, {
        "name": "Wireframing",
        "icon": "icons_wireframe--dark"
      } ],
      "goals": {
        "heading": "Goals",
        "subHeading": null,
        "goals": [
          {
            "heading": "Quick and supportive",
            "copy": "Most customers are buying one of their most expensive purchases on a two year commitment, so a key goal was to make the process as simple and transparent as possible."
          },
          {
            "heading": "Improve turnover",
            "copy": "Optional add ons and uptake of higher value options was lacking. Our aim with this project was to improve turnover by making the value clear to customers rather than disguising costs."
          },
          {
            "heading": "Minimise content work",
            "copy": "With 2-3 phone launches each week, in addition to various other devices, the load on content designers to create generic marketing copy and other product page content was unnecessarily high, resulting in hundreds of hours spent writing copy that the customer base may not read. Our aim was to maintain the information while saving customers and content designers time."
          }
        ]
      },
      "challenges": {
        "heading": "Challenges",
        "subHeading": null,
        "challenges": [
          {
            "heading": "Disjointed journey",
            "copy": "The existing journey allowed the user to make some choices (device and plan) on the product page with the remaining configuration of the bundle (smart benefits/extras, trade-in, insurance, etc.) happening after the item had been added to the basket and the customer was checking out. User research had shown that this caused confusion and mismatched information at both stages."
          },
          {
            "heading": "Complex product",
            "copy": "The new product page not only aimed to allow a customer to configure all parts of the bundle directly on the product page but also needed to be product agonostic for future business areas and effecient use of dev resource."
          },
          {
            "heading": "Merchandising requirements",
            "copy": "As an e-commerce business, maintaining or ideally increasing the number of merchandising touchpoints was an important consideration."
          }
        ]
      },
      "articleSections": [
        {
          "heading": "The starting point",
        "copy": "The existing product page bundled several complex decisions, such as monthly data, number of smart benefits and pricing, into one by using plan cards. This caused not only a high cognitive load on the user but was also confusing as many customers weren't familiar with constituent parts of the decision, such as Smart Benefits. In addition, the current product page lacked a To reduce the cognitive load on users the major building blocks of their purchase are split into separate decisions with relative pricing displayed. The relative pricing aims to serve both price sensitive customers as well as business interests by encouraging users that might not typically select higher value options to do so.",
        "asset": "EE_ExistingScreens_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Wireframing and rapid iterations",
        "copy": "The existing product page bundled several complex decisions, such as monthly data, number of smart benefits and pricing, into one by using plan cards. This caused not only a high cognitive load on the user but was also confusing as many customers weren't familiar with constituent parts of the decision, such as Smart Benefits. To reduce the cognitive load on users the major building blocks of their purchase are split into separate decisions with relative pricing displayed. The relative pricing aims to serve both price sensitive customers as well as business interests by encouraging users that might not typically select higher value options to do so.",
        "asset": "EE_Ideation_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Simplifying a complex bundle",
        "copy": "The existing product page bundled several complex decisions, such as monthly data, number of smart benefits and pricing, into one by using plan cards. This caused not only a high cognitive load on the user but was also confusing as many customers weren't familiar with constituent parts of the decision, such as Smart Benefits. To reduce the cognitive load on users the major building blocks of their purchase are split into separate decisions with relative pricing displayed. The relative pricing aims to serve both price sensitive customers as well as business interests by encouraging users that might not typically select higher value options to do so.",
        "asset": "EEPDP_PhoneConfig_Desktop_Compressed.mp4",
        "assetType": "mp4",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Putting the benefit before the decision",
        "copy": "The existing product pages asked customers to decide how many Smart Benefits (Premium subscriptions included in the price of more expensive plans) they want before they knew what they were, leaving the customer with a decision focused on cost rather than which benefits they would like to add to their plan. The solution was simple, create attractive and recognisable benefit cards that a customer can add directly from the product page rather than asking them how many they want.",
        "asset": "EEPDP_SmartBenefits_Desktop_Compressed.mp4",
        "assetType": "mp4",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Incorporating trade in seamlessly",
        "copy": "In addition to extras, such as the smart benefits above, it also made sense to integrate trade in into the product page configurator. For existing customers, any devices registered to their account automatically appear, saving them time and hassle when trading in.",
        "asset": "EEPDP_TradeIn_Desktop_Compressed.mp4",
        "assetType": "mp4",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Revamping the spec sheet",
        "copy": "The redesign of the features section was inspired by spec sheets and related designs, such as Lego or IKEA manuals. Despite being inspired by the pragmatism of spec sheets, I wanted to offer high quality product imagery a chance to shine. The result is a slide show stage that allows users to view all features at a glance while being able to learn more about a feature by clicking on a category of specs. The idea is that these general sections (e.g. display or materials) are shared across similar devices to ensure consistency across the site. More on the features in the next section..",
        "asset": "EEPDP_Features_Desktop_Compressed.mp4",
        "assetType": "mp4",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Time-saving features",
        "copy": "With the aim of reducing content designer effort and marketing fluff from the features section, I started with the concept of a spec sheet. While this minimalist approach may suit tech enthusiasts, a weekly critique session offered a good suggestion in makign the specs more easily understandable by the average consumer. To accomodate for this as well as keep editing time to a minimum, the features section pulls the specifications from the back end while being surrounded by generic explanatory copy for those who prefer a non-technical view.",
        "asset": "EE_FeaturesSections_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        }
      ] 

    }
  },
  {
    "title": "iOS Clock App",
    "description": "This conceptual feature is focused on improving an app used by millions - the iOS Clock app. Conversations with a wide range of users revealed a recurring issue for people wanting to easily set alarms that fit around their varying needs.",
    "tags": [
      "UI Design", "Figma"
    ],
    "backgroundColour": "radial-gradient(79.83% 181.5% at 93.4% 2.72%, #655B8D 0%, #10112B 100%)",
    "darkerColour": "#10112b",
    "heroImage": "iOSAlarms_4000x2001.png",
    "caseStudyContent": {
      "heading": "iOS Clock App",
      "subHeading": "This conceptual feature is focused on improving an app used by millions - the iOS Clock app. Conversations with a wide range of users revealed a recurring issue for people wanting to easily set alarms that fit around their varying needs.",
      "projectLink": null,
      "team": [{
        "name": "Eddie Tierney",
        "role": ["Product Designer"]
      }],
      "tools": [{
        "name": "Figma",
        "icon": "icons_figma--dark"
      },{
        "name": "Prototyping",
        "icon": "icons_prototype--dark"
      }, {
        "name": "UX Research",
        "icon": "icons_users--dark"
      }, {
        "name": "Wireframing",
        "icon": "icons_wireframe--dark"
      }, {
        "name": "Photoshop",
        "icon": "icons_adobe-photoshop--dark"
      }],
      "goals": {
        "heading": "Goals",
        "subHeading": null,
        "goals": [
          {
            "heading": "Ease of use",
            "copy": "Setting an alarm should be a quick action that allows users to manage their day within a tap or two. One of the largest user complaints revolved around the tedious setting and toggling of many alarms just to wake up in the morning. I made it a priority to improve this aspect."
          },
          {
            "heading": "Tailored around people",
            "copy": "Most of us hit snooze. Some of us accidentally fall back asleep. None of us live the same day every day. The grouped alarm functionality needed to provide flexibility without sacrificing the core functionality of an alarm."
          },
          {
            "heading": "Familiarity",
            "copy": "An app with a user base as large and diverse as the iOS Clock requires new features to be easily understood. I made it a priority to work within the current Apple Design Language of the time."
          }
        ]
      },
      "articleSections": [
        {
          "heading": "Existing friticion",
        "copy": "The existing alarms app was limited in functionality by the layout and configuration options. From researching how people use the app, we knew that most alarms were set in group around key daily events, however, the alarms app did not allow grouped alarms to be create or even easily managed. In addition, the primary action, inputting time was far away from a comfortable thumb reach and was hard to accruately control with a swiping gesture due to the small input size.",
        "asset": "iOSAlarms_OriginalScreens_6000x4000.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Off'n'on in one step",
        "copy": "Creating and managing a grouped alarm should be as simple as creating a one-off alarm. To achieve this, the existing UI was largely kept the same and an option to make it a grouped alarm was added. Using the existing component for the stopwatch, a user can quickly toggle and see the alarms added to the group. Once the alarm was saved, it would be visually identified by the layered icon showing the number of alarms in the group along with the option to toggle the whole group or individual alarms off or on.",
        "asset": "iOSAlarms_TwoScreenSolution_6000x4000.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Making it easy to plan your day",
        "copy": "Once a grouped alarm has been created, users had expressed a desire to order their alarms, so we added the option (when editing) to hold and drag to reorder alarms and grouped alarms. In addition, by tapping the icon showing how many alarms sit within a grouped alarm, a user can view all included alarms and toggle each one off or on.",
        "asset": "iOSAlarms_FirstSolutionUseCase_6000x4000.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        }
      ] 

    }
  },
  {
    "title": "Shelf (Coming soon)",
    "description": "Aimed at reducing food waste and making high quality meals easier, Shelf is a conceptual app that combines food inventory management, recipie suggestions and smart shopping lists.",
    "tags": [
      "UI Design", "App", "Figma"
    ],
    "backgroundColour": "radial-gradient(79.83% 181.5% at 93.4% 2.72%, #88CC86 0%, #2D7A68 100%)",
    "darkerColour": "#2D7A68",
    "heroImage": "Shelf_2000x1000.png",
    "caseStudyContent": {
      "heading": "Food Swiper",
      "subHeading": "Aimed at reducing food waste and making high quality meals easier, Shelf is a conceptual app that combines food inventory management, recipie suggestions and smart shopping lists.",
      "projectLink": null,
      "team": [{
        "name": "Eddie Tierney",
        "role": ["Product Designer"]
      }],
      "tools": [{
        "name": "Prototyping",
        "icon": "icons_prototype--dark"
      }, {
        "name": "UX Research",
        "icon": "icons_users--dark"
      }, {
        "name": "AdobeXD",
        "icon": "icons_adobeXd--dark"
      }],
      "goals": {
        "heading": "Goals",
        "subHeading": null,
        "goals": [
          {
            "heading": "Remove the hassle",
            "copy": "I came up with Shelf to reduce the 33% of fresh food that gets thrown away. The app aims to make planning and managing food on a daily basis as simple as modern mobile banking."
          },
          {
            "heading": "Foster social interaction",
            "copy": "Cooking and talking about food is inherently social. Leveraging this for both the benefit of the users as well as the growth of the app was very important."
          },
          {
            "heading": "Increase transparency",
            "copy": "We didn't just want to make managing food easier, we also wanted to improve the relationshio between retailers and consumers by offering simple ways to purchase and transparent post-purchase product information directly in the app."
          }
        ]
      },
      "articleSections": [
        {
          "heading": "Case study coming soon",
        "copy": "Check back again soon for the full case study.",
        "asset": "Shelf_HeroWithBackground.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        }
      ] 

    }
  },
  {
    "title": "EE Deal Zones",
    "description": "Redesigning EE's deal pages with a focus on improving conversion whilst also creating a better and more visually appealing experience.",
    "tags": [
      "Figma", "Prototyping", "UX Research"
    ],
    "backgroundColour": "radial-gradient(110.21% 244.81% at 93.4% 2.72%, #9466cb 0%, #270073 100%)",
    "darkerColour": "#270073",
    "heroImage": "DealZone_Hero_4000x2001.png",
    "caseStudyContent": {
      "heading": "EE Deal Zones",
      "subHeading": "Redesigning EE's deal pages with a focus on improving conversion whilst also creating a better and more visually appealing experience. Challenges of limited developer resource and presenting complex deal information had to be overcome to ensure success.",
      "projectLink": null,
      "team": [{
        "name": "Eddie Tierney",
        "role": ["Product Designer"] 
      }],
      "tools": [
        {
          "name": "Figma",
          "icon": "icons_figma--dark"
        },{
          "name": "Prototyping",
          "icon": "icons_prototype--dark"
        }, {
          "name": "Wireframing",
          "icon": "icons_wireframe--dark"
        }, {
        "name": "CSS3",
        "icon": "icons_css3--dark"
      }],
      "goals": {
        "heading": "Goals",
        "subHeading": null,
        "goals": [
          {
            "heading": "Improve conversion",
            "copy": "The existing deals page was suffering from low conversion. From the start, a lack of context for users and lacking UX stood out as major reasons for why many potential customers, often via paid media, would bounce from the page."
          },
          {
            "heading": "Better UX",
            "copy": "The business not only wanted to improve conversion, but also provide a more seamless and refined experience. The idea was that well-designed digital experiences not only look good but also increase customer trust and, in turn, conversion rates."
          },
          {
            "heading": "Increase merchandising",
            "copy": "For an e-commerce company, merchanising on deal pages is of course a priority. The aim for this project was to increase the merchansing opportunities without cluttering the UI."
          }
        ]
      },
      "challenges": {
        "heading": "Challenges",
        "subHeading": null,
        "challenges": [
          {
            "heading": "Limited developer resource",
            "copy": "Our team did not have developers directly within the team, so we had to design components and an overall experience that minimised the number of hours and lines of code that needed to be written."
          },
          {
            "heading": "Complex information",
            "copy": "The deals displayed on this page are all for specific configurations and often feature additional propositions, such as free headphones, network benefits or extra data."
          }
        ]
      },
      "articleSections": [
        {
          "heading": "The starting point",
        "copy": "The existing deals page was functional but fell short on fullfilling its use as a place to quickly find the right deal. It lacked a clear purpose for customers landing on the page, often coming straight from paid media, such as an email or MMS. In addition, the tabs provided very limited filtering for customers with specific requirements and the large, inefficient deal cards prevented customers from viewing other deals when the first landed on the page, thereby reducing the chance that a customer would find a deal they would be interested in.",
        
        "asset": "DealZone_ExistingScreens_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Thinking too small",
        "copy": "Initial wireframes and high-fidelity designs focused on 'repackaging' the existing experience and functionality. This meant maintaining the ability to configure the device and plan directly from the deals page. This not only increased the difficulty of the project, as more needed to fit in the same space, it also failed to consider that we already have a page dedicated to configuring these things - the product page. Therefore, to minimise developer effort and encourage the reuse of React components, we changed our approach to focus on letting customers find the right deal first. That being said, the initial designs did feature some quick wins, such as reducing repetition by summarising repeated information at the top of the page, adding explanatory subcopy to the page heading, reducing the size of the deal components to surface more deals at the same time and aligning related information along one axis for easier comparison between deals. Many of these changes focused on reducing the cognitive load on customers either by prominently summarising information that was previously repeated on each deal or by making the large amount of deals more easily digestable.",
        
        "asset": "DealZone_Ideation_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "One component to rule them all",
        "copy": "Throughout the project, I focused on reuse of existing components and/or minimal additional developement requirement. For the chosen design, the same component is used for the inactive and active deal state, for both mobile and desktop. The only difference between the active and inactive state is one line of CSS, which regulates the increased size of the active deal.",
        
        "asset": "DealZone_MobilePhones_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Look, compare, buy",
        "copy": "From existing user insights and unmoderated testing we knew that many customers already knew roughly what they wanted but preferred the option to compare similar devices and filter them to see how the deals stack up. To address this user need, chips for popular categories (e.g. iPhone or Samsung) and filters were introduced. More generally, the deals page now functioned as a comparison tool that linked to the product page rather than being a configurator in itself.",
        
        "asset": "DealZone_Filters.mp4",
        "assetType": "mp4",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "User testing the concept",
        "copy": "Our first in depth round of user testing produced very positive results. 5 out of 5 users were able to effectively use the design and the overall satisfaction rating was 6.2/7 (88.9%). Qualitatively, all users immediately understood what kind of page they were on, how to navigate the page using swipe and tap gestures and stated that they found it easy to find a device that they wanted. 4 out of 5 users liked the imagery-led approach and the level of information, with one user emphasising that if he couldn't easily browse the deals, he would go elsewhere.",
        "asset": "DealZone_PreUserTesting_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Iterating on the results",
        "copy": "While the testing results were positive, I wanted to implement some of the iteration ideas that I had noted as a result of the research. These improvements included making the whole deal component a link (allowing the user to intuitively tap the device to visit the product page), ordering the deals in a logical order (e.g. by release date) and showing key device selling points while browsing the deals (e.g. battery life).",
        "asset": "DealZone_MobilePhones_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "The latest version",
        "copy": "As of writing this case study, here are the latest mobile and desktop designs for the deal pages along with a before and after comparison.",
        "asset": "DealZones_DesktopBrowsing.mp4",
        "assetType": "mp4",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": null,
        "copy": null,
        "asset": "DealZone_NewMobile.mp4",
        "assetType": "mp4",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": null,
        "copy": null,
        "asset": "DealZone_MobileOldVsNew_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        }
      ] 

    }
  },
  {
    "title": "Evopack",
    "description": "Evopack, a Swiss/German start-up, asked me to build a brand and website to represent their revolutionary and sustainable packaging solutions. As part of this, I created a custom design system and built their web app using React, SCSS, Figma and TypeScript.",
    "tags": [
      "Front-end dev", "React", "Figma"
    ],
    "backgroundColour": "radial-gradient(110.21% 244.81% at 93.4% 2.72%, #7687C7 0%, #051732 100%)",
    "darkerColour": "#051732",
    "heroImage": "Evopack_2000x1000.png",
    "caseStudyContent": {
      "heading": "Evopack",
      "subHeading": "Evopack, a Swiss/German start-up, asked me to build a brand and website to represent their revolutionary and sustainable packaging solutions. As part of this, I created a custom design system and built their web app using React, SCSS, Figma and TypeScript.",
      "projectLink": "https://evopack.tech/",
      "team": [{
        "name": "Eddie Tierney",
        "role": [["Product Designer"], "Front-end Developer", "Branding"] 
      }],
      "tools": [{
        "name": "React",
        "icon": "icons_react--dark"
      }, {
        "name": "TypeScript",
        "icon": "icons_typescript--dark"
      },{
        "name": "SASS",
        "icon": "icons_sass--dark"
      }, {
        "name": "CSS3",
        "icon": "icons_css3--dark"
      }, {
        "name": "Git",
        "icon": "icons_git--dark"
      },{
        "name": "HTML5",
        "icon": "icons_html5--dark"
      },{
        "name": "JavaScript",
        "icon": "icons_javascript--dark"
      }, {
        "name": "Figma",
        "icon": "icons_figma--dark"
      },{
        "name": "Prototyping",
        "icon": "icons_prototype--dark"
      }, {
        "name": "Wireframing",
        "icon": "icons_wireframe--dark"
      }],
      "goals": {
        "heading": "Goals",
        "subHeading": null,
        "goals": [
          {
            "heading": "Brand recognition and contact",
            "copy": "The challenge for this project was building a new brand and e-commerce site at the same time. Therefore I had to marry the emotional and technical requirements of a fledgling brand."
          },
          {
            "heading": "Modern and scalable",
            "copy": "The challenge for this project was building a new brand and e-commerce site at the same time. Therefore I had to marry the emotional and technical requirements of a fledgling brand."
          },
          {
            "heading": "Maintainable",
            "copy": "Evopack is a multi-national company, operating in English, German and French. They needed a digital estate that they can easily update, including allowing customers to translate content between different languages."
          }
        ]
      },
      "articleSections": [
        {
          "heading": "Modular from the ground up",
        "copy": "To minimise design and developement work, I used atomic design principles when creatign Evopack's scalable design system. Working up from a core colour pallette and atomic components, such as buttons, links and text, all higher order components are created with lower order components.",
        
        "asset": "Evopack_Homepage_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Focused on developing connections",
        "copy": "During the short term, Evopack's primary goal was to build connections with potential customers and investors. To support this goal, I designed and developed a streamlined contact section that uses email.js to communicate between the front-end applcation (React) and server. The contact form react component appears at the bottom of all relevant pages to encourage visitors to engage with it and other components, such as the quote section below, are designed to highlight the ambition and individuals driving the company.",
        
        "asset": "Evopack_LaptopStack_6000x4000.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Reusable page structures",
        "copy": "To leverage the power of reusable react components, I also focussed on designing and building higher order components, such as entire page structures, that can be easily reused. One example is the hub page for topics such as product applications and the services that Evopack provides. Each page features a custom tabs component that renders the data for the respective subsection (e.g. Hygiene Consulting within Services). This page structure also features information boxes, carousels and the aforementioned contact component to educate visitors and allow them to easily contact Evopack.",
        
        "asset": "Evopack_ServicesAndContact_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Precision and humanity in one style",
        "copy": "Evopack design style not only needed to be distinctive but also convey the human emotion and ingenuity in the effort to make big industry more sustainable. I used handwritten accents along with a soft, bright and rounded aestethic when designing components to make the brand more approachable and friendly to customers.",
        "asset": "Evopack_Applications_4000x2001.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Content editable in multiple languages",
        "copy": "As Evopack operates in regions speaking German, English and French, they required a web app that allows users to quickly switch between languages. The solution I came up with avoided automatic translators as these can often misinterpret the nuances of languages, instead opting a custom solution involving content written in all required languages and using a toggle on the site to switch between the desired content language. To achieve this, I used the useContext hook in React to make the chosen language available throughout the application and organised the JSON file with the website content into language objects at the top level. On the page level components, the application fetches the JSON file and pulls in the content based on which lanuage is active in the react context.",
        "asset": "Evopack_LaptopWithPhoneView_6000x4000.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        }
      ] 

    }
  },
  {
    "title": "Atiq.Studio",
    "description": "Atiq.Studio is a small e-commerce business selling creative projects, such as photography, clothing and digital products. I worked on the website and logo design as well as the final development of the e-commerce store.",
    "tags": [
      "Front-end dev", "React", "Figma"
    ],
    "backgroundColour": "radial-gradient(79.83% 181.5% at 93.4% 2.72%, #1E6389 0%, #0A0000 100%)",
    "darkerColour": "#0A0000",
    "heroImage": "Atiq_4000x2001.png",
    "caseStudyContent": {
      "heading": "Atiq.Studio",
      "subHeading": "Atiq.Studio is a small e-commerce business selling creative projects, such as photography, clothing and digital products. I worked on the website and logo design as well as the final development of the e-commerce store.",
      "projectLink": "https://atiq.studio",
      "team": [{
        "name": "Eddie Tierney",
        "role": ["Product Designer", "Front-end Developer"]
      }, {
        "name": "Will Browne",
        "role": ["Marketing"]
      }],
      "tools": [{
        "name": "React",
        "icon": "icons_react--dark"
      }, {
        "name": "CSS3",
        "icon": "icons_css3--dark"
      }, {
        "name": "Figma",
        "icon": "icons_figma--dark"
      },{
        "name": "SASS",
        "icon": "icons_sass--dark"
      }, {
        "name": "Git",
        "icon": "icons_git--dark"
      },{
        "name": "HTML5",
        "icon": "icons_html5--dark"
      },{
        "name": "JavaScript",
        "icon": "icons_javascript--dark"
      }],
      "goals": {
        "heading": "Goals",
        "subHeading": null,
        "goals": [
          {
            "heading": "Scalable and maintainable",
            "copy": "As a storefront for creatives, Atiq needed to be easily scalable as the business grows. In order to focus on the running of the shop and creation of projects, the store’s structure also needed to accommodate a wide variety of different products."
          },
          {
            "heading": "Learn React, Sass and TypeScript",
            "copy": "Having built several websites using HTML, CSS and Vanilla JavaScript, I wanted to use this project as an opportunity to expand my skillset and understand how JS frameworks function. This included related syntaxes, such as JSX and GraphQL."
          },
          {
            "heading": "Exploration with a swift route to purchase",
            "copy": "Atiq aims to promote independent artists and encourage users to discover unique projects. A priority was therefore maximising conversion for the artists by offering a swift journey to checkout whilst also introducing an aspect of exploration and novelty to the store."
          }
        ]
      },
      "challenges": {
        "heading": "Challenges",
        "subHeading": null,
        "challenges": [
          {
            "heading": "Varied product lines",
            "copy": "Accommodating a large and unknown variety of products and styles meant that the design and code needed to the flexible. Creating a distinctive and bold brand is made more difficult when the contents vary."
          },
          {
            "heading": "Transitioning to a virtual DOM mindset",
            "copy": "Learning React and how the components are rendered was one of the key learning curves in this project. Not only understanding how to break up components to maximise the atomic design benefits but also the use of React’s in-built hooks to optimise performance and minimise rerendering."
          },
          {
            "heading": "Brand new brand",
            "copy": "Without an existing design system or brand guidelines to follow, I had to develop a unique design language and appropriate brand. This included motion guidelines, brand guidelines, photographic style, iconography and a UI/design system."
          }
        ]
      },
      "articleSections": [
        {
          "heading": "A content-led brand",
        "copy": "The chosen brand colours and aesthetic was purposefully understated so that the varied product lines could stand out. This included the choice to minimise the amount of Atiq-focused pages and multiple routes to purchase, so that the brand doesn’t get in the way of customers completing their purchase.",
        "asset": "TEMPORARY_AtiqOnGreyBackground.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "DRY approach to development",
        "copy": "The design and codebase of Atiq should be as small and maintainable as possible. In order to achieve this, everything was designed with the DRY approach in mind. This meant that designs focused on components that would be reusable, which in turn allowed the React components to minimise repetitive code by mapping over these pragmatic components. This applied from the individual design atoms, such as headings and buttons, right up to large components, such as the product carousels and the pages themselves. For instance, instead of repeatedly coding <p></p> tags and adding the desired styles to each instance, I created a <Text /> component which took props to set specific styles and could be used globally throughout the web app. Larger components, such as the product line carousels and product pages are also agnostic to the content within it, allowing them to be reused and development time to be short.",
        "asset": "Atiq_HomePageTop_6000x4000.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        },
        {
          "heading": "Learning React",
        "copy": "Coming from a more ‘traditional’ web development level, I needed to learn how the single page application (SPA) structure of a framework like React works. I began by building several components, including complex ones, within the App.tsx file before breaking them out into smaller components and a more sophisticated file structure. This allowed me to understand how and where React imports the components into the final root div to render in a way the browser can understand. During this process, I also learned about and applied frequently used javascript methods in React, such as mapping, Object destructuring, types of variables (const, let, var), states, hooks, and interfaces. ",
        "asset": "Atiq_ClothingPageTop_6000x4000.jpg",
        "assetType": "jpg",
        "assetAlt": "This is a case study image"
        }
      ] 

    }
  }
  ]
}